#include "main.h"

abilityi bsmeta<abilityi>::elements[] = {{"Strenght", "Сила", "СЛ", "силы", "слабости", "сильнее", "слабее"},
{"Dexterity", "Ловкость", "ЛВ", "ловкости", "неуклюжести", "ловче", "неуклюже"},
{"Constitution", "Телосложение", "ТЛ", "телосложения", "болезни", "здоровее", "болезнее"},
{"Intellegence", "Интеллект", "ИН", "интеллекта", "глупости", "умнее", "глупее"},
{"Wisdow", "Мудрость", "МД", "мудрости", "наивности", "мудрее", "наивнее"},
{"Charisma", "Харизма", "ХР", "харизмы", "уродства", "харизматичнее", "уродливее"},
//
{"AttackMelee", "Шанс удачного удара", "Ат", "попадания", "промазывания", "сильнее", "слабее", {Strenght, Multiply2, -20}},
{"AttackRanged", "Шанс удачного выстрела", "Ат", "меткости", "косоглазия", "метче", "косее", {Dexterity, Multiply2, -20}},
{"DamageMelee", "Урон рукопашный", "Пв", "урона", "лечения", "сильнее", "слабее", {Strenght, Divide2, -5}},
{"DamageRanged", "Урон дистанция", "Пв", "урона", "лечения", "сильнее", "слабее"},
{"Pierce", "Прокалывание", "Пр", "проникания", "затупления", "сильнее", "слабее"},
{"Protection", "Защита", "Зщ", "защиты", "открытости", "защищеннее", "слабее", {Acrobatics, Divide4}},
{"Armor", "Броня", "Бр", "брони", "", "защищенее", "уязвимее"},
{"Deflect", "Отражение", "Оу", "отражения", "уязвимости", "защищеннее", "уязвимее"},
{"Speed", "Скорость", "Ск", "скорости", "замедления", "быстрее", "медленнее", {95, Athletics, Divide10, Dexterity, Divide2}},
{"Visibility", "Обзор", "Об", "обзора", "слепоты", "лучше", "хуже", {6}},
//
{"Level", "Уровень", "", "опыта", "", "опытнее", "глупее"},
{"LifePoints", "Жизнь", "", "здоровья", "проклятия здоровья", "лучше", "хуже", {Constitution}},
{"LifeRate", "Восстановление жизни", "", "регенерации", "белокровия", "лучше", "хуже", {Healing}},
{"ManaPoints", "Мана", "", "маны", "проклятия маны", "лучше", "хуже", {Wisdow}},
{"ManaRate", "Восстановление маны", "", "воодушевления", "унылости", "лучше", "хуже", {Concetration}},
};
assert_enum(ability, ManaRate);

ability_s abilityi::getid() const {
	return ability_s(this - bsmeta<abilityi>::elements);
}