#include "main.h"

BSDATA(abilityi) = {{"Strenght", "Сила", "СЛ", "силы", "слабости", "сильнее", "слабее", {}, 0, 1, "%+1i", 2},
{"Dexterity", "Ловкость", "ЛВ", "ловкости", "неуклюжести", "ловче", "неуклюже", {}, 0, 1, "%+1i", 2},
{"Constitution", "Телосложение", "ТЛ", "телосложения", "болезни", "здоровее", "болезнее", {}, 0, 1, "%+1i", 1},
{"Intellegence", "Интеллект", "ИН", "интеллекта", "глупости", "умнее", "глупее", {}, 0, 1, "%+1i", 2},
{"Wisdow", "Мудрость", "МД", "мудрости", "наивности", "мудрее", "наивнее", {}, 0, 1, "%+1i", 1},
{"Charisma", "Харизма", "ХР", "харизмы", "уродства", "харизматичнее", "уродливее", {}, 0, 1, "%+1i", 0},
{"Attack", "Шанс попадания", "Ат", "попадания", "промаха", "сильнее", "слабее", {Dexterity, Multiply2, -20}, 0, 4, "%+1i%%", 1},
{"Damage", "Урон", "Пв", "урона", "лечения", "сильнее", "слабее", {Strenght, Divide2, -5}, 0, 1, "%+1i", 3},
{"Pierce", "Прокалывание", "Пр", "проникания", "затупления", "сильнее", "слабее", {}, 0, 1, "%+1i", 1},
{"Protection", "Защита", "Зщ", "защиты", "открытости", "защищеннее", "слабее", {Acrobatics, Divide4}, 0, 5, "%+1i%%", 1},
{"Armor", "Броня", "Бр", "брони", "", "защищенее", "уязвимее", {}, 0, 1, "%+1i", 3},
{"Deflect", "Отражение", "Оу", "отражения", "уязвимости", "защищеннее", "уязвимее", {}, 0, 1, "%+1i%%", 2},
{"Speed", "Скорость", "Ск", "скорости", "замедления", "быстрее", "медленнее", {95, Athletics, Divide10, Dexterity, Divide2}, 0, 1, "%+1i", 2},
{"Movement", "Передвижение", "Мв", "движения", "замедления", "подвижнее", "замедленней", {}, 0, 1, "%+1i", 1},
{"Visibility", "Обзор", "Об", "обзора", "слепоты", "лучше", "хуже", {5}, 0, 1, "%+1i", 2},
{"Level", "Уровень", "Ур", "опыта", "", "опытнее", "глупее", {}, 0, 0, 0, 1},
{"LifePoints", "Жизнь", "Ож", "лечения", "яда", "лучше", "хуже", {Constitution, Divide2}, 0, 5, "%+1i", 0},
{"LifeRate", "Восстановление жизни", "Вж", "регенерации", "белокровия", "лучше", "хуже", {Constitution, Multiply2, Healing, Divide4}, 0, 40, "%+1i", 1},
{"ManaPoints", "Мана", "Ом", "восстановления", "опустошения", "лучше", "хуже", {Wisdow}, 0, 5, "%+1i", 0},
{"ManaRate", "Восстановление маны", "Вм", "воодушевления", "унылости", "лучше", "хуже", {Intellegence, Multiply2, Concetration, Divide4}, 0, 50, "%+1i", 1},
};
assert_enum(abilityi, ManaRate)

ability_s abilityi::getid() const {
	return ability_s(this - bsmeta<abilityi>::elements);
}

int	abilityi::getbonus(int v) const {
	if(!v)
		return 0;
	if(v > 0)
		v = bonus_base + bonus_multiplier*v;
	else
		v = bonus_multiplier*v;
	return v;
}