#include "main.h"

BSDATA(abilityi) = {
	{"Strenght", "Сила", "СЛ", "силы", "слабости", "сильнее", "слабее", {}, 1, "%+1i", 2},
	{"Dexterity", "Ловкость", "ЛВ", "ловкости", "неуклюжести", "ловче", "неуклюже", {}, 1, "%+1i", 2},
	{"Constitution", "Телосложение", "ТЛ", "телосложения", "болезни", "здоровее", "болезнее", {}, 1, "%+1i", 1},
	{"Intellegence", "Интеллект", "ИН", "интеллекта", "глупости", "умнее", "глупее", {}, 1, "%+1i", 2},
	{"Wisdow", "Мудрость", "МД", "мудрости", "наивности", "мудрее", "наивнее", {}, 1, "%+1i", 1},
	{"Charisma", "Харизма", "ХР", "харизмы", "уродства", "харизматичнее", "уродливее", {}, 1, "%+1i", 0},
	{"Attack", "Шанс попадания", "Ат", "попадания", "промаха", "сильнее", "слабее", {}, 10, "%+1i%%", 1},
	{"AttackMelee", "Шанс попадания рукопашная", "Ат", "попадания", "промаха", "сильнее", "слабее", {}, 10, "%+1i%%", 1},
	{"AttackRanged", "Шанс попадания дистанция", "Ат", "попадания", "промаха", "сильнее", "слабее", {}, 10, "%+1i%%", 1},
	{"Damage", "Урон", "Пв", "урона", "лечения", "сильнее", "слабее", {}, 1, "%+1i", 3},
	{"DamageMelee", "Урон", "Пв", "урона", "лечения", "сильнее", "слабее", {}, 1, "%+1i", 3},
	{"DamageRanged", "Урон", "Пв", "урона", "лечения", "сильнее", "слабее", {}, 1, "%+1i", 3},
	{"Pierce", "Прокалывание", "Пр", "проникания", "затупления", "сильнее", "слабее", {}, 1, "%+1i", 1},
	{"Protection", "Защита", "Зщ", "защиты", "открытости", "защищеннее", "слабее", {}, 5, "%+1i%%", 1},
	{"Armor", "Броня", "Бр", "брони", "", "защищенее", "уязвимее", {}, 1, "%+1i", 3},
	{"Deflect", "Отражение", "Оу", "отражения", "уязвимости", "защищеннее", "уязвимее", {}, 1, "%+1i%%", 2},
	{"Luck", "Удача", "Уд", "удачи", "неудачи", "удачливее", "неудачливее", {}, 1, "%1i", 1},
	{"Speed", "Скорость", "Ск", "скорости", "замедления", "быстрее", "медленнее", {}, 1, "%+1i", 2},
	{"Movement", "Передвижение", "Мв", "движения", "замедления", "подвижнее", "замедленней", {}, 1, "%+1i", 1},
	{"Visibility", "Обзор", "Об", "обзора", "слепоты", "лучше", "хуже", {5}, 1, "%+1i", 2},
	{"Level", "Уровень", "Ур", "опыта", "", "опытнее", "глупее", {}, 0, 0, 1},
	{"LifePoints", "Жизнь", "Ож", "лечения", "яда", "лучше", "хуже", {}, 10, "%+1i", 0},
	{"LifeRate", "Восстановление жизни", "Вж", "регенерации", "белокровия", "лучше", "хуже", {}, 40, "%+1i", 1},
	{"ManaPoints", "Мана", "Ом", "восстановления", "опустошения", "лучше", "хуже", {Wisdow}, 10, "%+1i", 0},
	{"ManaRate", "Восстановление маны", "Вм", "воодушевления", "унылости", "лучше", "хуже", {Intellegence, Multiply2, Concetration, Divide4}, 50, "%+1i", 1},
	{"FaithPoints", "Вера", "Вр", "веры", "безбожности", "православнее", "безбожнее", {1, Religion, Divide10}, 50, "%+1i", 1},
};
assert_enum(abilityi, FaithPoints)

ability_s abilityi::getid() const {
	return ability_s(this - bsdata<abilityi>::elements);
}

int	abilityi::getbonus(int v) const {
	if(!v)
		return 0;
	return bonus_multiplier * v;
}