#include "main.h"

abilityi bsmeta<abilityi>::elements[] = {{"Strenght", "Сила", "СЛ", "силы", "слабости"},
{"Dexterity", "Ловкость", "ЛВ", "ловкости", "неуклюжести"},
{"Constitution", "Телосложение", "ТЛ", "телосложения", "болезни"},
{"Intellegence", "Интеллект", "ИН", "интеллекта", "глупости"},
{"Wisdow", "Мудрость", "МД", "мудрости", "наивности"},
{"Charisma", "Харизма", "ХР", "харизмы", "уродства"},
//
{"AttackMelee", "Шанс удачного удара", "", "попадания", "промазывания"},
{"AttackRanged", "Шанс удачного выстрела", "", "меткости", "косоглазия"},
{"Pierce", "Прокалывание", "", "проникания", "затупления"},
{"Deflect", "Отражение", "", "отражения", ""},
{"Armor", "Броня", "", "брони", ""},
{"Damage", "Урон", "", "урона", ""},
{"Speed", "Скорость", "", "скорости", ""},
{"Visibility", "Обзор", "", "обзора", ""},
//
{"LifePoints", "Жизнь", "", "здоровья", ""},
{"LifeRate", "Восстановление жизни", "", "магии", ""},
{"ManaPoints", "Мана", "", "регенерации", ""},
{"ManaRate", "Восстановление маны", "", "воодружения", ""},
};
assert_enum(ability, ManaRate);