#include "main.h"

abilityi bsmeta<abilityi>::elements[] = {{"Strenght", "Сила", "СЛ", "силы", "слабости", "сильнее", "слабее", {}, 0, 1, "%+1i"},
{"Dexterity", "Ловкость", "ЛВ", "ловкости", "неуклюжести", "ловче", "неуклюже", {}, 0, 1, "%+1i"},
{"Constitution", "Телосложение", "ТЛ", "телосложения", "болезни", "здоровее", "болезнее", {}, 0, 1, "%+1i"},
{"Intellegence", "Интеллект", "ИН", "интеллекта", "глупости", "умнее", "глупее", {}, 0, 1, "%+1i"},
{"Wisdow", "Мудрость", "МД", "мудрости", "наивности", "мудрее", "наивнее", {}, 0, 1, "%+1i"},
{"Charisma", "Харизма", "ХР", "харизмы", "уродства", "харизматичнее", "уродливее", {}, 0, 1, "%+1i"},
//
{"Attack", "Шанс попадания", "Ат", "попадания", "промазывания", "сильнее", "слабее", {Dexterity, Multiply2, -20}, 0, 1, "%+1i%%"},
{"Damage", "Урон", "Пв", "урона", "лечения", "сильнее", "слабее", {Strenght, Divide2, -5}, 0, 1, "%+1i"},
{"Pierce", "Прокалывание", "Пр", "проникания", "затупления", "сильнее", "слабее", {}, 0, 1, "%+1i"},
{"Protection", "Защита", "Зщ", "защиты", "открытости", "защищеннее", "слабее", {Acrobatics, Divide4}, 0, 5, "%+1i%%"},
{"Armor", "Броня", "Бр", "брони", "", "защищенее", "уязвимее", {}, 0, 1, "%+1i"},
{"Deflect", "Отражение", "Оу", "отражения", "уязвимости", "защищеннее", "уязвимее", {}, 0, 1, "%+1i%%"},
{"Speed", "Скорость", "Ск", "скорости", "замедления", "быстрее", "медленнее", {95, Athletics, Divide10, Dexterity, Divide2}, 0, 1, "%+1i"},
{"Visibility", "Обзор", "Об", "обзора", "слепоты", "лучше", "хуже", {6}, 0, 1, "%+1i"},
//
{"Resist Acid", "Сопротивление кислоте", "", "защиты от кислоты", "уязвимости к кислоте", "защищеннее", "уязвимее", {}, 20, 10, "%+1i%%"},
{"Resist Charm", "Сопротивление шарму", "", "защиты от шарма", "уязвимости к шарму", "защищеннее", "уязвимее", {}, 20, 10, "%+1i%%"},
{"Resist Ice", "Сопротивление холоду", "", "защиты от холода", "уязвимости к холоду", "защищеннее", "уязвимее", {}, 20, 10, "%+1i%%"},
{"Resist Lighting", "Сопротивление электричеству", "", "защиты от молнии", "узявимости к молнии", "защищеннее", "уязвимее", {}, 20, 10, "%+1i%%"},
{"Resist Fire", "Сопротивление огню", "", "защиты от огня", "уязвимости к огню", "защищеннее", "уязвимее", {}, 20, 10, "%+1i%%"},
{"Resist Paralize", "Сопротивление параличу", "", "защиты от паралича", "уязвимости к параличу", "защищеннее", "уязвимее", {}, 20, 10, "%+1i%%"},
{"Resist Poison", "Сопротивление яду", "", "защиты от яда", "уязвимости к яду", "защищеннее", "уязвимее", {}, 20, 10, "%+1i%%"},
{"Resist Water", "Дыхание водой", "", "защиты от воды", "уязвимости к воде", "защищеннее", "уязвимее", {}, 20, 10, "%+1i%%"},
//
{"Level", "Уровень", "", "опыта", "", "опытнее", "глупее", {}, 0, 0},
{"LifePoints", "Жизнь", "", "здоровья", "проклятия здоровья", "лучше", "хуже", {Constitution}, 0, 5, "%+1i"},
{"LifeRate", "Восстановление жизни", "", "регенерации", "белокровия", "лучше", "хуже", {Healing}, 0, 40, "%+1i"},
{"ManaPoints", "Мана", "", "маны", "проклятия маны", "лучше", "хуже", {Wisdow}, 0, 5, "%+1i"},
{"ManaRate", "Восстановление маны", "", "воодушевления", "унылости", "лучше", "хуже", {Concetration}, 0, 50, "%+1i"},
};
assert_enum(ability, ManaRate);

ability_s abilityi::getid() const {
	return ability_s(this - bsmeta<abilityi>::elements);
}

int	abilityi::getbonus(int v) const {
	if(!v)
		return 0;
	if(v > 0)
		v = bonus_base + bonus_multiplier*v;
	else
		v = bonus_multiplier*v;
	return v;
}