#include "main.h"

abilityi bsmeta<abilityi>::elements[] = {{"Strenght", "Сила", "СЛ", "силы", "слабости"},
{"Dexterity", "Ловкость", "ЛВ", "ловкости", "неуклюжести"},
{"Constitution", "Телосложение", "ТЛ", "телосложения", "болезни"},
{"Intellegence", "Интеллект", "ИН", "интеллекта", "глупости"},
{"Wisdow", "Мудрость", "МД", "мудрости", "наивности"},
{"Charisma", "Харизма", "ХР", "харизмы", "уродства"},
//
{"AttackMelee", "Шанс удачного удара", "", "попадания", "промазывания", {40, Strenght}},
{"AttackRanged", "Шанс удачного выстрела", "", "меткости", "косоглазия", {40, Dexterity}},
{"Pierce", "Прокалывание", "", "проникания", "затупления"},
{"Deflect", "Отражение", "", "отражения", "", {Acrobatics, Divide4}},
{"Armor", "Броня", "", "брони", ""},
{"Damage", "Урон", "", "урона", "лечения", {Strenght, Divide4, -2}},
{"Speed", "Скорость", "", "скорости", "замедления"},
{"Visibility", "Обзор", "", "обзора", "слепоты"},
//
{"Level", "Уровень", "", "опыта", ""},
{"LifePoints", "Жизнь", "", "здоровья", "", {Constitution}},
{"LifeRate", "Восстановление жизни", "", "магии", ""},
{"ManaPoints", "Мана", "", "регенерации", "", {Intellegence, Concetration, Divide4}},
{"ManaRate", "Восстановление маны", "", "воодружения", ""},
};
assert_enum(ability, ManaRate);