#include "main.h"

template<> damagei bsmeta<damagei>::elements[] = {{"Ударное", {}, 20, "%герой перенес удар без последствий."},
{"Режущее", {}, 20, "%герой перенес ранение без последствий."},
{"Колющее", {}, 20, "%герой перенес ранение без последствий."},
{"Кислота", ResistAcid, 20, "Кислота не смогла нанести урон."},
{"Холод", ResistCold, 30, "%герой не подвергся воздействию холода."},
{"Элетричество", ResistElectricity, 20, "%герой впитал%а все электричество."},
{"Огонь", ResistFire, 5, "Огонь не смог опалить %героя."},
{"Магия", {}, 40, "Магия не причинила урона."},
{"Яд", ResistPoison, 20, "Яд не оказал воздействия."},
{"Вода", ResistWater, 30, "%герой смог%ла дышать водой."},
};