#include "main.h"

BSDATA(damagei) = {
	{"Ударное", 1, 15, Constitution, "%герой перенес удар без последствий."},
	{"Режущее", 1, 20, Constitution, "%герой перенес ранение без последствий."},
	{"Колющее", 1, 25, Constitution, "%герой перенес ранение без последствий."},
	{"Кислота", -2, 90, Constitution, "Кислота не смогла нанести урон."},
	{"Чары", -3, 80, Wisdow, "%герой и глазом не моргнул%а."},
	{"Холод", -3, 80, Constitution, "%герой не подвергся воздействию холода."},
	{"Элетричество", 3, 100, Constitution, "%герой впитал%а все электричество."},
	{"Огонь", 2, 100, Constitution, "Огонь не смог опалить %героя."},
	{"Магия", 0, 0, Wisdow, "Заклинание не причинило вреда."},
	{"Яд", 0, 0, Constitution, "%герой переборол%а яд."},
	{"Вода", 6, 100, Constitution, "%герой смог%ла дышать водой."},
};
assert_enum(damagei, WaterAttack)