#include "main.h"

template<> damagei bsmeta<damagei>::elements[] = {{"Ударное", {}, 1, 15, "%герой перенес удар без последствий."},
{"Режущее", {}, 1, 20, "%герой перенес ранение без последствий."},
{"Колющее", {}, 1, 25, "%герой перенес ранение без последствий."},
{"Кислота", ResistAcid, -2, 40, "Кислота не смогла нанести урон."},
{"Холод", ResistCold, -3, 40, "%герой не подвергся воздействию холода."},
{"Элетричество", ResistElectricity, 3, 50, "%герой впитал%а все электричество."},
{"Огонь", ResistFire, 2, 60, "Огонь не смог опалить %героя."},
{"Магия", {}, 0, 0, "Магия не причинила урона."},
{"Яд", ResistPoison, 0, 0, "Яд не оказал воздействия."},
{"Вода", ResistWater, 6, 100, "%герой смог%ла дышать водой."},
};