#include "main.h"

BSDATA(materiali) = {{"—текло", {"стекл€ное", "стекл€ный", "стекл€на€"}, { {Bludgeon, -40}}},
{"∆елезо", {"железное", "железный", "железна€"}, {{Acid, -40}, {WaterAttack, -20}, {Piercing, 10}}},
{" ожа", {"кожанное", "кожанный", "кожанна€"}, {{Acid, -10}}},
{"ќрганика", {"органическое", "органический", "органическа€"}, {{Acid, -20}, {WaterAttack, 20}}},
{"Ѕумага", {"бумажное", "бумажный", "бумажна€"}, {{Fire, -40}}},
{" амень", {"каменное", "каменный", "каменна€"}, {{Fire, 30}, {Piercing, 40}, {Slashing, 20}}},
{"ƒерево", {"дерев€нное", "дерев€нный", "дерев€нна€"}, {{Slashing, -20}, {Piercing, -10}}},
};
assert_enum(materiali, Wood)