#include "main.h"

BSDATA(materiali) = {
	{"—текло", {"стекл€ное", "стекл€ный", "стекл€на€"}, {}, {Bludgeon}},
	{"∆елезо", {"железное", "железный", "железна€"}, {Piercing}, {Acid, WaterAttack}},
	{" ожа", {"кожанное", "кожанный", "кожанна€"}, {}, {Acid}},
	{"ќрганика", {"органическое", "органический", "органическа€"}, {}, {Acid, WaterAttack}},
	{"Ѕумага", {"бумажное", "бумажный", "бумажна€"}, {}, {Fire}},
	{" амень", {"каменное", "каменный", "каменна€"}, {Fire, Piercing, Slashing}},
	{"ƒерево", {"дерев€нное", "дерев€нный", "дерев€нна€"}, {Piercing}, {Slashing}},
};
assert_enum(materiali, Wood)