#include "main.h"

template<> roomi bsmeta<roomi>::elements[] = {{"", ""},
{"Сокровищница", "Сокровищница"},
{"Спуск ниже", "Спуск вниз", StairsDown},
{"Подъем наверх", "Подъем наверх", StairsUp},
{"Дом", "Дом"},
{"Логово", "Логово"},
{"Храм", "Храм %1", Altar},
{"Таверна", "Таверна \"%+1 %2\""},
{"Бараки", "Бараки"},
{"Магистратура", "Магистратура"},
{"Магазин оружия и брони", "Магазин %1 %2"},
{"Магазин элексиров", "Магазин %1 %2"},
{"Магазин заклинаний", "Магазин %1 %2"},
{"Магазин еды", "Магазин %1 %2"},
};