#include "main.h"

sloti bsmeta<sloti>::elements[] = {{"Head", "Голова", "на голове"},
{"Neck", "Шея", "на шее"},
{"Melee", "Правая рука", "в руке"},
{"OffHand", "Левая рука", "в другой руке"},
{"TorsoBack", "Спина", "на спине"},
{"Torso", "Торс", "одето"},
{"RightFinger", "Правое кольцо", "на пальце"},
{"LeftFinger", "Левое кольцо", "на другом пальце"},
{"Elbows", "Локти", "на локтях"},
{"Legs", "Ноги", "на ногах"},
{"Ranged", "Дистанционное", "дистанционное"},
{"Amunitions", "Аммуниция", "в колчане"},
{"Backpack", "Рюкзак", "в рюкзаке"},
};
assert_enum(slot, FirstBackpack);