#include "main.h"

BSDATA(sloti) = {{"", "Рюкзак", "В рюкзаке"},
{"Edible", "Съестное", ""},
{}, {}, {}, {}, {}, {}, {}, {}, {},
{}, {}, {}, {}, {}, {}, {}, {}, {}, {},
{}, {}, {}, {}, {}, {}, {}, {}, {}, {},
{},
//
{"Head", "Голова", "На голове"},
{"Neck", "Шея", "На шее"},
{"Melee", "Правая рука", "В руке"},
{"OffHand", "Левая рука", "В другой руке"},
{"TorsoBack", "Спина", "На спине"},
{"Torso", "Торс", "Одето"},
{"RightFinger", "Правое кольцо", "На пальце"},
{"LeftFinger", "Левое кольцо", "На другом пальце"},
{"Elbows", "Локти", "На локтях"},
{"Legs", "Ноги", "На ногах"},
{"Ranged", "Дистанционное", "Дистанционное"},
{"Amunitions", "Аммуниция", "В колчане"},
{"Tool", "Инструмент", "За спиной"},
};
assert_enum(sloti, LastWear)