#include "main.h"

statei bsmeta<statei>::elements[] = {{"Инфразрение", "ночного зрения", {Friendly}},
{"Ошеламлен", "ошеломления", {Hostile}, 0, "%герой очухался от головокружения."},
{"Пьяный", "опьянения", {Hostile}, "%герой опьянел%а в дрызг.", "%герой немного протрезвел%а."},
{"Ужас", "страха", {Hostile}, "%герой испытал%а животный ужас.", "%герой немного успокоил%ась."},
{"Дружественен", "дружбы", {Friendly}},
{"Враждебен", "вражды", {Hostile}},
{"Невидим", "невидимости", {}, "Внезапно %герой исчез%ла из виду.", "%герой появил%ась из неоткуда."},
{"Болен", "болезни", {Hostile}, "%герой заболел%а.", "%герой почуствовал%а себя гораздо лучше."},
{"Отвлечен", "отвлечения", {Hostile}},
{"Ранен", "рассечения", {Hostile}, 0, "Кровотечение у %героя прекратилось."},
};
assert_enum(state, LastState);