#include "main.h"

statei bsmeta<statei>::elements[] = {{"Anger", "Злой", "злости", {Hostile}, "%герой разозлил%ась.", "%герой перестал%а злиться."},
{"Darkvision", "Инфразрение", "ночного зрения", {Friendly}},
{"Dazzled", "Ошеламлен", "ошеломления", {Hostile}, 0, "%герой очухался от головокружения."},
{"Drunken", "Пьяный", "опьянения", {Hostile}, "%герой опьянел%а в дрызг.", "%герой немного протрезвел%а."},
{"Fear", "Ужас", "страха", {Hostile}, "%герой испытал%а животный ужас.", "%герой немного успокоил%ась."},
{"Friendly", "Дружественен", "дружбы", {Friendly}},
{"Hostile", "Враждебен", "вражды", {Hostile}},
{"Invisible", "Невидим", "невидимости", {}, "Внезапно %герой исчез%ла из виду.", "%герой появил%ась из неоткуда."},
{"Poisoned", "Отравлен", "отравления", {Hostile}, "%герой почуствовал%а себя гораздо хуже.", "%герой почуствовал%а себя гораздо лучше."},
{"Sick", "Болен", "болезни", {Hostile}, "%герой почуствовал%а себя гораздо хуже.", "%герой почуствовал%а себя гораздо лучше."},
{"Sleeped", "Спит", "сна", {Hostile}, "%герой проснул%ась.", "Неожиданно %герой заснул%а."},
{"Unaware", "Отвлечен", "отвлечения", {Hostile}},
{"Wounded", "Ранен", "рассечения", {Hostile}, 0, "Кровотечение у %героя прекратилось."},
};
assert_enum(state, LastState);