#include "main.h"

statei bsmeta<statei>::elements[] = {{"Anger", "Злой", "злости", true, "%герой перестал%а злиться."},
{"Dazzled", "Ошеламлен", "ошеломления", true, "%герой очухался от головокружения."},
{"Drunken", "Пьяный", "опьянения", true, "%герой немного протрезвел%а."},
{"Friendly", "Дружественен", "дружбы", false},
{"Hostile", "Враждебен", "вражды", true},
{"Hunger", "Голоден", "голода", true},
{"Invisible", "Невидим", "невидимости", false},
{"Poisoned", "Отравлен", "отравления", true},
{"Sick", "Болен", "болезни", true},
{"Sleeped", "Спит", "сна", true, "%герой проснул%ась."},
{"Wounded", "Ранен", "рассечения", true, "Кровотечение у %героя прекратилось."},
};
assert_enum(state, LastState);