#include "main.h"

template<> trapi bsmeta<trapi>::elements[] = {{"", "trap_a"},
{"«меинное логово", "trap_a", 10, 1, {2, 4}, GoblinWarrior, "—о всех щелей полезли змеи!"},
{"яма с кислотой", "trap_ac", 0, 1, {2, 8}, Acid, "%герой провалил%ась в в €му с кислотой."},
{"—амострел", "trap_ar", -10, 1, {1, 4}, Piercing, "»з стены вылетела стрела."},
{"яма с эфиром", "trap_c", -20, 1, {1, 6}, Magic, "—низу по€вилось фиолетовое свечение."},
{"Ёлектрическа€ ловушка", "trap_ce", -20, 1, {1, 8}, Electricity, "–аздалс€ громкий хлопок разр€да молнии."},
{"ќгненна€ ловушка", "trap_f", -10, 1, {2, 12}, Electricity, "—низу вырвалось пл€м€, коготорое опалило стены."},
{"—ветова€ ловушка", "trap_l", -5, 1, {}, Dazzled, "¬незапно по€ивлась вспышка ослепительного света."},
{"√лубока€ €ма", "trap_pc", 20, 1, {}, {}, ""},
{"яма с коль€ми", "trap_pc", 0, 1, {2, 12}, Piercing, ""},
{"ƒротик из стены", "trap_s", 0, 1, {1, 8}, Piercing, "»з стены вылетел дротик."},
{"Ћезви€ из пола", "trap_st", 0, 1, {3, 18}, Slashing, "»з пола выехали острые лезви€."},
{"јура ржавчины", "trap_t", 0, 1, {}, {}, ""},
{"¬од€на€ ловушка", "trap_w", 0, 1, {3, 18}, WaterAttack, "ћощный поток воды обрушилс€ сверху."},
};
assert_enum(trap, TrapWater);